/**************************************************************************
 *         Copyright(c) 2012 by iCatch Technology Co., Ltd.              *
 *                                                                        *
 *  This software is copyrighted by and is the property of iCatch Tech-  *
 *  nology Co., Ltd. All rights are reserved by iCatch Technology Co.,   *
 *  Ltd. This software may only be used in accordance with the            *
 *  corresponding license agreement. Any unauthorized use, duplication,   *
 *  distribution, or disclosure of this software is expressly forbidden.  *
 *                                                                        *
 *  This Copyright notice "M U S T" not be removed or modified without    *
 *  prior written consent of iCatch Technology Co., Ltd.                 *
 *                                                                        *
 *  iCatch Technology Co., Ltd. reserves the right to modify this        *
 *  software without notice.                                              *
 *                                                                        *
 *  iCatch Technology Co., Ltd.                                          *
 *  19-1, Innovation First Road, Science-Based Industrial Park,           *
 *  Hsin-Chu, Taiwan, R.O.C.                                              *
 *                                                                        *
 *************************************************************************/

#include "app_com_def.h"
#include "app_com_api.h"

#include "app_menu.h"
#include "app_menu_event.h"
#include "app_menu_core.h"
#include "app_menu_tab.h"
#include "app_menu_disp.h"
#include "app_menu_disp1.h"
#include "app_ui_para.h"
#include "app_osd_api.h"
#include "app_icon_def.h"
#include "app_res_def.h"
#include "app_pal.h"
#include "gpio_custom.h"
#include "sp5k_gfx_api.h"
#include "sp5k_pip_api.h"
#include "sp5k_rsvblk_api.h"
#include "app_playback_osd.h"
#include "../app_ver.h"
#if FUNC_HOST_TOUCH_PANEL
#include "app_ts_util.h"
#endif
#define ROUND_DOWN_TO_DIVISIBLE(num,div) \
	( (UINT32)(num) & -(UINT32)(div) )
#define ROUND_UP_TO_DIVISIBLE(num,div) \
	ROUND_DOWN_TO_DIVISIBLE( (UINT32)(num) + (div) - 1, div )


/**************************************************************************
 *                          D A T A    T Y P E S                          *
 **************************************************************************/
#if HDMI_MENU_BY_JPG
typedef struct menuSrcHDMI_s{
	UINT8* fileName;
	UINT32 pos[4];  /* X pos,Y pos, width ,height  */
}menuSrcHDMI_t;

enum{
	HDMI_PIP_MAIN		=	SP5K_GFX_PAGE_PIP_MAIN,
	HDMI_MENU_LAYER0	=	SP5K_GFX_PAGE_PIP_BASE+0,
	HDMI_MENU_LAYER1	=	SP5K_GFX_PAGE_PIP_BASE+1,
	HDMI_MENU_LAYER2	=	SP5K_GFX_PAGE_PIP_BASE+2,
	HDMI_MENU_LAYER3	=	SP5K_GFX_PAGE_PIP_BASE+3,
	HDMI_MENU_LAYER4	=	SP5K_GFX_PAGE_PIP_BASE+4
};

enum {
	/* reference the order of ID_ICONFILE_MODE_HDMI -- s */
	MENU_STILL_HDMI,
	MENU_VIDEO_HDMI,
	MENU_AUDIO_HDMI,
	MENU_PLAYBACK_HDMI,
	MENU_SETUP_HDMI,
	MENU_PRINTER_HDMI,
	/* reference the order of ID_ICONFILE_MODE_HDMI -- e */
	MENU_SCENE_HDMI,

	MENU_TITLE_POS1_HDMI,
	MENU_TITLE_POS2_HDMI,
	MENU_ADJUST_LEFT_HDMI,
	MENU_ADJUST_RIGHT_HDMI,
	MENU_BUTTON_OK_HDMI,
	MENU_BUTTON_MENU_HDMI,

	MENU_BODY_HDMI,
	MENU_FIVE_LINES_BAR_HDMI,
	MENU_FOUR_LINES_BODY_HDMI,
	MENU_FOUR_LINES_BAR_HDMI,
	MENU_THREE_LINES_BODY_HDMI,
	MENU_THREE_LINES_BAR_HDMI,
	MENU_TWO_LINES_BODY_HDMI,

	MENU_FIVE_LINES_SCROLL_HDMI,
	MENU_FOUR_LINES_SCROLL_HDMI,

	MENU_ADJUST_DIALOG_HDMI,
	MENU_SOUND_ADJUST_1_HDMI,
	MENU_SOUND_ADJUST_2_HDMI
};

static menuSrcHDMI_t menuSrcFileInfo[] = {
	[MENU_STILL_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\STILL.JPG",			{140,25,166,150}},
	[MENU_VIDEO_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\VIDEO.JPG",			{140,25,166,150}},
	[MENU_AUDIO_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\AUDIO.JPG",			{140,25,166,150}},
	[MENU_PLAYBACK_HDMI]			=	{"A:\\RO_RES\\UI\\JPG\\PLAYBACK.JPG",		{140,25,166,150}},
	[MENU_SETUP_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\SETUP.JPG",			{420,25,166,150}},
	[MENU_PRINTER_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\PRINTER.JPG",		{140,25,166,150}},
	[MENU_SCENE_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\SCENE.JPG",			{140,25,166,150}},

	[MENU_TITLE_POS1_HDMI]			=	{"A:\\RO_RES\\UI\\JPG\\TITLE.JPG",			{20,5,412,220}},
	[MENU_TITLE_POS2_HDMI]			=	{"A:\\RO_RES\\UI\\JPG\\TITLE.JPG",			{300,5,412,220}},
	[MENU_ADJUST_LEFT_HDMI]			=	{"A:\\RO_RES\\UI\\JPG\\ADJUST_LEFT.JPG",	{1200,325,42,76}},
	[MENU_ADJUST_RIGHT_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\ADJUST_RIGHT.JPG",	{1456,325,42,76}},
	[MENU_BUTTON_OK_HDMI]			=	{"A:\\RO_RES\\UI\\JPG\\BUTTON_OK.JPG",		{150,985,197,80}},
	[MENU_BUTTON_MENU_HDMI]			=	{"A:\\RO_RES\\UI\\JPG\\BUTTON_MENU.JPG",	{1400,985,198,80}},

	[MENU_BODY_HDMI]				=	{"A:\\RO_RES\\UI\\JPG\\MENU_BODY.JPG",		{0,0,1920,1080}},
	[MENU_FIVE_LINES_BAR_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\FIVE_LINES_BAR.JPG",	{0,220,1858,140}},
	[MENU_FOUR_LINES_BODY_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\FOUR_LINES_BODY.JPG",{200,295,1618,592}},
	[MENU_FOUR_LINES_BAR_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\FOUR_LINES_BAR.JPG",	{214,307,1534,134}},
	[MENU_THREE_LINES_BODY_HDMI]	=	{"A:\\RO_RES\\UI\\JPG\\THREE_LINES_BODY.JPG",{180,360,1616,588}},
	[MENU_THREE_LINES_BAR_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\THREE_LINES_BAR.JPG",{0,0,1593,138}},
	[MENU_TWO_LINES_BODY_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\TWO_LINES_BODY.JPG",	{150,510,1618,448}},

	[MENU_FIVE_LINES_SCROLL_HDMI]	=	{"A:\\RO_RES\\UI\\JPG\\FIVE_LINES_SCROLL.JPG",{0,0,22,90}},
	[MENU_FOUR_LINES_SCROLL_HDMI]	=	{"A:\\RO_RES\\UI\\JPG\\FOUR_LINES_SCROLL.JPG",{0,0,21,90}},

	[MENU_ADJUST_DIALOG_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\ADJUST_DIALOG.JPG",	{1244,320,208,86}},
	[MENU_SOUND_ADJUST_1_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\SOUND_ADJUST_1.JPG",	{0,0,324,26}},
	[MENU_SOUND_ADJUST_2_HDMI]		=	{"A:\\RO_RES\\UI\\JPG\\SOUND_ADJUST_2.JPG",	{0,0,38,64}},
};

enum{
	PRELOAD_MODE_STILL			=	0,
	PRELOAD_MODE_VIDEO			=	1,
	PRELOAD_MODE_AUDIO			=	2,
	PRELOAD_MODE_PLAYBACK		=	3,
	PRELOAD_MODE_SETUP			=	4,
	PRELOAD_MODE_PRINTER		=	5,

	PRELOAD_MENU_BODY			=	6,
	PRELOAD_FIVE_LINES_BAR		=	7,
	PRELOAD_FOUR_LINES_BODY		=	8,
	PRELOAD_FOUR_LINES_BAR		=	9,

	PRELOAD_BUTTON_OK			=	10,
	PRELOAD_BUTTON_MENU			=	11,
	PRELOAD_MENU_TITLE			=	12
};
#endif

typedef enum {
	ICON_ID_STILL = 0,
	ICON_ID_VIDEO = 1,
	ICON_ID_AUDIO = 2,
	ICON_ID_PLAYBACK,
	ICON_ID_SETUP,
	ICON_ID_DPS
} modeIconID_t;

/**************************************************************************
 *                           C O N S T A N T S                            *
 **************************************************************************/
#define WIDTH_ICON_MUSUSBAR			256
#define WIDTH_ICON_MUSBAR			237
#define WIDTH_ICON_MUDLGBAR			296

#define WIDTH_ICON_MODE				40
#define HEIGHT_ICON_MODE			32

#define WIDTH_ICON_MUSUSBAR_HDMI	WIDTH_ICON_MUSUSBAR
#define WIDTH_ICON_MUBAR_HDMI		WIDTH_ICON_MUSBAR

static UINT16 MENU_HEADER_TAB1_X;
static UINT16 MENU_HEADER_TAB2_X;
static UINT16 MENU_HEADER_TAB_Y;
static UINT16 MENU_HEADER_MODE_X;
static UINT16 MENU_HEADER_MODE_Y;
static UINT16 MENU_HEADER_SET_X;
static UINT16 MENU_HEADER_SET_Y;

//#define MENU_MODE_X_ODDSET
static UINT16 MENU_MODE_Y_OFFSET;// 4

UINT16 MENU_CHAR_WIDTH;//  16
UINT16 MENU_CHAR_HEIGHT;// 30//31

static UINT16 MENU_LAYER1_STR_X_OFFSET;// 32
static UINT16 MENU_LAYER1_STR_Y_OFFSET;// 		(43+MENU_MODE_Y_OFFSET)//44
static SINT16 MENU_LAYER1_ICON_X_OFFSET;// (-16)
static UINT16 MENU_LAYER1_ICON_Y_OFFSET;// (43+MENU_MODE_Y_OFFSET)//44
static UINT16 MENU_LAYER2_STR_X_OFFSET;// 56
static UINT16 MENU_LAYER2_STR_Y_OFFSET;// 60
static UINT16 MENU_LAYER2_ICON_X_OFFSET;// 4
static UINT16 MENU_LAYER2_ICON_Y_OFFSET;// 60

static UINT16 MENU_BAR_LAYER1_X_OFFSET;// 24
static UINT16 MENU_BAR_LAYER1_Y_OFFSET;// (43+MENU_MODE_Y_OFFSET-3)//44
static UINT16 MENU_BAR_LAYER2_X_OFFSET;// 48
static UINT16 MENU_BAR_LAYER2_Y_OFFSET;// 61-3
static UINT16 MENU_BAR_LAYER3_X_OFFSET;// 32
static UINT16 MENU_BAR_LAYER3_Y_OFFSET;// 44

static UINT16 MENU_BODY_LAYER1_X_OFFSET;// 16
static UINT16 MENU_BODY_LAYER1_Y_OFFSET;// (33+MENU_MODE_Y_OFFSET)//34
static UINT16 MENU_BODY_LAYER2_X_OFFSET;// 40
static UINT16 MENU_BODY_LAYER2_Y_OFFSET;// 47//49
static UINT16 MENU_BODY_LAYER3_X_OFFSET;// 14
static UINT16 MENU_BODY_LAYER3_Y_OFFSET;// 96-3

static UINT16 MENU_OFFSET;
static UINT16 MENU_MU2BARSL_WIDTH;
static UINT16 MENU_HEADER_OFFSET;
static UINT16 MENU_BACK_ON_OFFSET;

/**************************************************************************
 *                         G L O B A L    D A T A                         *
 **************************************************************************/
UINT32 menuPosBackup;
UINT16 LCD_WIDTH;// ((UINT16)320)
UINT16 LCD_HEIGHT;// ((UINT16)240)
#if HDMI_MENU_BY_JPG
static UINT32 dlgUpdateFlag = 0;
extern UINT32 pipHDMIMenuFlag;
#endif
#if CAM_TYPE_CVR||CAM_TYPE_SPC||CAM_TYPE_DUAL||CAM_TYPE_SBC  /*add for system state*/
static UINT32 strId_Reset[]={ID_STR_YES,ID_STR_NO};
#endif
#if CAM_TYPE_CVR||CAM_TYPE_SPC||CAM_TYPE_DUAL||CAM_TYPE_SBC   /*add for system state*/
UINT32 RTCTimer=TIMER_NULL;
UINT32 GSENSORTimercount;
#endif
extern UINT8 fileTypeSelect;
extern UINT8 USBModeSet;
